Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་མཚན་ཉིད་དམ། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུའི་མཚན་ཉིད་དམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་མཚན་ཉིད་དམ། རྒྱུན་ཏུ་ཞུགས་པའི་མཚན་ཉིད་དམ། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་དམ། ཆོས་ཀྱི་མཚན་ཉིད་ཐ་དད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་གང་ཡང་དམིགས་སམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, they cannot, Blessed Lord!” “

source: རབ་འབྱོར་དེ་ལྟ་བས་ན་རྣམ་གྲངས་དེས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ལ་ཡང་སོ་སོའི་སྐྱེ་བོ་མེད། སོ་སོའི་སྐྱེ་བོ་ལས་གུད་ནའང་དེ་མེད།
en: Therefore, Subhūti, one should know for this very reason that in the reality of all phenomena there are no ordinary persons, nor anyone other than ordinary persons.

source: དེ་ལ་ཡང་དད་པའི་རྗེས་སུ་འབྲང་བ་ཡང་མེད། དད་པའི་རྗེས་སུ་འབྲང་བ་ལས་གུད་ན་ཡང་དེ་མེད།
en: In it there are no followers on account of faith, nor anyone other than followers on account of faith.

source: དེ་ལ་ཡང་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་མེད། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་ལས་གུད་ན་འང་དེ་མེད།
en: In it there are no followers of the Dharma, nor anyone other than followers of the Dharma.

source: དེ་ལ་བརྒྱད་པ་ཡང་མེད། བརྒྱད་པ་ལས་གུད་ན་ཡང་དེ་མེད། དེ་ལ་ཡང་རྒྱུན་ཏུ་ཞུགས་པ་མེད།
en: In it there is no one on the eighth level, nor anyone other than those of the eighth level.

source: རྒྱུན་ཏུ་ཞུགས་པ་ལས་གུད་ན་ཡང་དེ་མེད།
en: In it there is no one entering the stream to nirvāṇa, nor anyone other than those entering the stream to nirvāṇa.

source: དེ་ལ་ཡང་ལན་ཅིག་ཕྱིར་འོང་བ་མེད། ལན་ཅིག་ཕྱིར་འོང་བ་ལས་གུད་ན་འང་དེ་མེད།
en: In it there is no one destined for only one more rebirth, nor anyone other than those destined for only one more rebirth.

source: དེ་ལ་ཡང་ཕྱིར་མི་འོང་བ་མེད། ཕྱིར་མི་འོང་བ་ལས་གུད་ན་འང་དེ་མེད།
en: In it there is no one no longer subject to rebirth, nor anyone other than those no longer subject to rebirth.

source: དེ་ལའང་དགྲ་བཅོམ་པ་མེད། དགྲ་བཅོམ་པ་ལས་གུད་ན་འང་དེ་མེད།
en: In it there are no arhats, nor anyone other than arhats.

source: དེ་ལའང་རང་སངས་རྒྱས་མེད། རང་སངས་རྒྱས་ལས་གུད་ན་འང་དེ་མེད།
en: In it there are no pratyekabuddhas, nor anyone other than pratyekabuddhas.

source: དེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མེད། བྱང་ཆུབ་སེམས་དཔའ་ལས་གུད་ན་འང་དེ་མེད།
en: In it there are no bodhisattvas, nor anyone other than bodhisattvas.

source: དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མེད། དེ་བཞིན་གཤེགས་པ་ལས་གུད་ན་འང་དེ་མེད་པར་རིག་པར་བྱའོ།
en: In it there are no tathāgatas, nor anyone other than tathāgatas.” {

source: ཆོས་ཉིད་དེ་འདུས་བགྱིས་པ་ལགས་སམ། འདུས་མ་བགྱིས་པ་ལགས།
en: VIII: 176} “Blessed Lord, is that reality conditioned, or is it unconditioned?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ནི་འདུས་བྱས་ཀྱང་མ་ཡིན། འདུས་མ་བྱས་ཀྱང་མ་ཡིན་ཏེ།
en: It is neither conditioned nor unconditioned,” replied the Blessed One. “

source: འདུས་བྱས་ལས་གུད་ན་འང་འདུས་མ་བྱས་དམིགས་སུ་མེད་དོ།
en: That is to say, the unconditioned cannot be apprehended apart from the conditioned, and the conditioned cannot be apprehended apart from the unconditioned.

source: །འདུས་མ་བྱས་ལས་གུད་ན་འང་འདུས་བྱས་དམིགས་སུ་མེད་དེ། རབ་འབྱོར་དེ་ལྟར་འདུས་བྱས་ཀྱི་ཁམས་གང་ཡིན་པ་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་གང་ཡིན་པའི་ཆོས་དེ་གཉིས་ཀ་ཡང་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ཏེ། གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ།
en: Therefore, Subhūti, both conditioned elements and unconditioned elements are neither conjoined nor disjoined, and they are immaterial, invisible, and unimpeded, with a single defining characteristic, in that they are without defining characteristics.

source: ཐོགས་པ་མེད་པ། མཚན་ཉིད་གཅིག་པ་སྟེ། འདི་ལྟ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པའོ། །དེ་ཡང་དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་བརྗོད་ཀྱི་དོན་དམ་པར་མ་ཡིན་ཏེ།
en: This the tathāgatas say in mundane conventional terms, but not by way of ultimate reality.

source: དོན་དམ་པ་ལ། ལུས་ཀྱི་འདུ་བྱེད་དམ། ངག་གི་འདུ་བྱེད་དམ། ཡིད་ཀྱི་འདུ་བྱེད་མེད་དེ།
en: For, in ultimate reality, there are no formative predispositions of body, formative predispositions of speech, or formative predispositions of mind.

source: ལུས་ཀྱི་འདུ་བྱེད་དམ། ངག་གི་འདུ་བྱེད་དམ། ཡིད་ཀྱི་འདུ་བྱེད་ལས་གུད་ན་ཡང་དོན་དམ་པར་དམིགས་སུ་མེད་དོ།
en: Nor is ultimate reality apprehended as anything other than formative predispositions of body, formative predispositions of speech, or formative predispositions of mind.

source: འོན་ཀྱང་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་དོན་དམ་པ་སྟེ།
en: Yet, the sameness of conditioned and unconditioned phenomena is ultimate reality.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དོན་དམ་པ་ལས་ཀྱང་མི་གཡོ་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་བྱེད་དོ།
en: For this reason, when bodhisattva great beings practice the perfection of wisdom, they do not stir from ultimate reality but they also practice the conduct of a bodhisattva.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་བདུན་ཅུ་པའོ།། །།
en: This completes the seventieth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེའི་སླད་དུ་ཆོས་གང་ལ་ཡང་གང་ཡང་ཅི་ཡང་བགྱིད་པ་མ་མཆིས་ན།
en: Chapter 71: The Teaching on the Unchanging True Nature Then the venerable Subhūti asked the Blessed One, “Blessed Lord, the sameness of all phenomena is empty of inherent existence—there is nothing at all that does anything to anything.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ཅི་ཡང་བགྱིད་པ་མ་མཆིས་ཤིང་། ཅི་ཡང་མ་ལགས་པ་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དོན་དམ་པ་ལས་ཀྱང་མི་གཡོ་ལ། སྦྱིན་པ་དང་ཚིག་སྙན་པ་དང་དོན་བགྱི་བ་དང་དོན་འཐུན་པས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བགྱིད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Since all phenomena do nothing whatsoever and are nothing whatsoever, how is it that, when bodhisattva great beings practice the perfection of wisdom, they do not stir from ultimate truth but still act for the sake of all beings through [the attractive qualities of] generosity, pleasant speech, purposeful activity, and harmony?” “

source: །དེ་དེ་བཞིན་ཏེ། ཇི་སྐད་དུ་སྨྲས་པ་བཞིན་ཏེ།
en: It is just as you have said,” replied the Blessed One. “

source: སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་གང་ལ་ཡང་ཅི་ཡང་བྱེད་པ་མེད་ཅི་ཡང་མི་བྱེད་པ་ཡང་མེད་དེ་གལ་ཏེ་སེམས་ཅན་འདི་དག་བདག་ཅག་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཤེས་ན་ནི། དེ་ལྟར་སྟོང་པ་ཉིད་ལས་ཀྱང་མི་གཡོ་ལ། སེམས་ཅན་རྣམས་ཀྱང་བདག་གི་འདུ་ཤེས་དང་བྲལ་བར་བྱེད་ཅིང་། བདག་གི་འདུ་ཤེས་དང་ཕྲལ་ནས་སྟོང་པ་ཉིད་ཀྱིས་འཁོར་བ་ལས་འགྲེལ་བ་དང་། སེམས་ཅན་གྱི་འདུ་ཤེས་དང་། སྲོག་གི་འདུ་ཤེས་དང་། གསོ་བའི་འདུ་ཤེས་དང་། སྐྱེས་བུའི་འདུ་ཤེས་དང་། གང་ཟག་གི་འདུ་ཤེས་དང་། ཤེད་ཅན་གྱི་འདུ་ཤེས་དང་། ཤེད་བདག་གི་འདུ་ཤེས་དང་། བྱེད་པ་པོའི་འདུ་ཤེས་དང་། ཚོར་བ་པོའི་འདུ་ཤེས་དང་། ཤེས་པ་པོའི་འདུ་ཤེས་དང་།
en: Emptiness does not do anything to anything at all, nor does it not do anything to anything at all.

source: མཐོང་བ་པོའི་འདུ་ཤེས་དང་བྲལ་བར་བྱེད་ཅིང་། མཐོང་བ་པོའི་འདུ་ཤེས་དང་ཕྲལ་ནས་སྟོང་པ་ཉིད་ཀྱིས་འཁོར་བ་ལས་འགྲེལ་བ་དང་། གཟུགས་ཀྱི་འདུ་ཤེས་དང་བྲལ་བར་བྱེད་ཅིང་། གཟུགས་ཀྱི་འདུ་ཤེས་དང་ཕྲལ་ནས། སྟོང་པ་ཉིད་ཀྱིས་འཁོར་བ་ལས་འགྲེལ་བ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་དང་བྲལ་བར་བྱེད་ཅིང་། རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་དང་ཕྲལ་ནས། སྟོང་པ་ཉིད་ཀྱིས་འཁོར་བ་ལས་འགྲེལ་བ་དང་།
en: If beings themselves knew emptiness, there would not be [a need for] the power of the tathāgatas’ leadership, whereby without stirring from emptiness they separate all beings from the notion of self, and having separated them from the notion of self, liberate them from cyclic existence through emptiness; or separate them from the notion of beings, the notion of life forms, the notion of living beings, the notion of life, the notion of living creatures, the notion of individual personalities, the notion of human beings, the notion of people, the notion of actors, the notion of petitioners, the notion of experiencers, the notion of knowers, and the notion of viewers, and having separated them from the notion of viewers [and so forth], liberate them from cyclic existence through emptiness; or separate them from the notion of physical forms, and having separated them from the notion of physical forms, liberate them from cyclic existence through emptiness; {Ki.

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་འདུ་ཤེས་དང་བྲལ་བར་བྱེད་ཅིང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་འདུ་ཤེས་དང་ཕྲལ་ནས། སྟོང་པ་ཉིད་ཀྱིས་འཁོར་བ་ལས་འགྲེལ་བ་དང་། འདུས་བྱས་ཀྱི་ཁམས་ཀྱི་འདུ་ཤེས་དང་བྲལ་བར་བྱེད་ཅིང་། འདུས་བྱས་ཀྱི་ཁམས་ཀྱི་འདུ་ཤེས་དང་ཕྲལ་ནས། འདུས་མ་བྱས་ཀྱི་དབྱིངས་སྟོང་པ་ཡིན་ཡང་འདུས་མ་བྱས་ཀྱི་དབྱིངས་སུ་འགོད་པ་ཡང་། དེ་བཞིན་གཤེགས་པའི་ཁྱུ་མཆོག་གི་མཐུར་མི་འགྱུར་རོ།
en: VIII: 177} or separate them from the notion of feelings, perceptions, formative predispositions, and consciousness, and having separated them from the notion of consciousness [and so forth], liberate them from cyclic existence through emptiness; or separate them from the notion of the sense fields, the sensory elements, and the links of dependent origination, and having separated them from the notion of the links of dependent origination [and so forth], liberate them from cyclic existence through emptiness; or separate them from the notion of conditioned elements, and having separated them from the notion of conditioned elements, establish them in the unconditioned expanse, which is also empty.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ཅིས་སྟོང་པ་ལགས།
en: Blessed Lord, of what is that [unconditioned expanse] empty?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདུ་ཤེས་ཐམས་ཅད་ཀྱིས་སྟོང་སྟེ།
en: It is empty of all notions,” replied the Blessed One. “

source: རབ་འབྱོར་ལ་ལ་ཞིག་གིས་སྤྲུལ་པ་ཞིག་སྤྲུལ་ན། དེ་ལ་གང་སྟོང་པ་ཉིད་མ་ཡིན་པ་དེ་ལྟ་བུའི་དངོས་པོ་གང་ཡང་ཡོད་དམ། གསོལ་པ།
en: Subhūti, if someone were to conjure up a phantom emanation, would there be any entity in it, which is not emptiness?” “

source: །སྤྲུལ་པ་དེ་ལ་གང་སྟོང་པ་ཉིད་མ་ལགས་པ་དེ་ལྟ་བུའི་དངོས་པོ་གང་ཡང་མ་མཆིས་ཏེ།
en: There would be no entity at all in that phantom emanation that would not be emptiness. {Ki.

source: སྟོང་པ་ཉིད་གང་ལགས་པ་དང་། སྤྲུལ་པ་གང་ལགས་པའི་ཆོས་དེ་གཉིས་ཀ་དང་ཡང་ལྡན་པ་ཡང་མ་ལགས། མི་ལྡན་པ་ཡང་མ་ལགས་ཏེ།
en: VIII: 178} Both emptiness and the phantom emanation are neither conjoined nor disjoined.

source: དེ་གཉིས་ཀ་ཡང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་ན།
en: Indeed, both are empty owing to emptiness.

source: དེ་ཅིའི་སླད་དུ་འདི་ནི་སྟོང་པ་ཉིད་དོ།
en: If this is the case, why is this point concealed when it is said, ‘This is emptiness.

source: །འདི་ནི་སྤྲུལ་པའོ་ཞེས་བགྱི་བར་རྣམ་པར་བཅབ་པ་མཛད།
en: That is a phantom emanation’?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་དང་། སྤྲུལ་པ་གཉིས་ཀ་ཡང་སྟོང་པ་ཉིད་ལ་དམིགས་སུ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་སམ།
en: If one were to ask why, it is because neither emptiness nor the phantom emanation is apprehended in emptiness.” “

source: ཚོར་བ་འམ། འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་གང་སྤྲུལ་པ་མ་ཡིན་པ་དེ་ལྟ་བུ་ཡོད་དམ། གང་སྤྲུལ་པ་དེ་ནི་སྟོང་པའོ། །གསོལ་པ།
en: Subhūti,” continued the Blessed One, “there is nothing in physical forms, feelings, perceptions, formative predispositions, or consciousness that is not a phantom emanation, and any phantom emanation is empty.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་འཇིག་རྟེན་པའི་ཆོས་སྤྲུལ་པ་ལགས་ཀྱང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། དེ་དག་གི་འབྲས་བུ་གང་གིས་གང་ཟག་རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་།
en: Blessed Lord, if mundane phenomena are phantom emanations, are supramundane phenomena—the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the three gateways of liberation, the four truths of the noble ones, all the aspects of emptiness, the eight aspects of liberation, the nine serial steps of meditative absorption, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and their fruits through which individual persons are established as entering the stream to nirvāṇa, being destined for only one more rebirth, being no longer subject to rebirth, arhats, pratyekabuddhas, and tathāgatas, arhats, completely awakened buddhas—not also similar to a phantom emanation?” “

source: དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤེས་གང་ཟག་རྣམ་པར་དགོད་པའི་ཆོས་དེ་དག་ཀྱང་སྤྲུལ་པ་ལྟ་བུ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྤྲུལ་པ་སྟེ།
en: Subhūti,” replied the Blessed One, “all phenomena are phantom emanations.

source: དེ་ལ་ལ་ལ་ནི་ཉན་ཐོས་ཀྱིས་སྤྲུལ་པའོ།
en: Some are emanated by śrāvakas.

source: །ལ་ལ་ནི་རང་སངས་རྒྱས་ཀྱིས་སྤྲུལ་པའོ།
en: Some are emanated by pratyekabuddhas.

source: །ལ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྤྲུལ་པའོ།
en: Some are emanated by bodhisattvas.

source: ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའོ།
en: Some are emanated by tathāgatas.

source: །ལ་ལ་ནི་ཉོན་མོངས་པས་སྤྲུལ་པའོ།
en: Some are emanated by afflicted mental states.

source: །ལ་ལ་ནི་ལས་ཀྱིས་སྤྲུལ་པའོ།
en: Some are emanated by past actions.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་ཆོས་ཐམས་ཅད་སྤྲུལ་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་གང་སྤངས་པ་ཞེས་བགྱི་བ། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ།
en: For this reason, Subhūti, all phenomena are phantom emanations.” “

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་སངས་རྒྱས་ཀྱི་ས་འམ། སངས་རྒྱས་ཀྱི་ས་འམ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤངས་པའི་ཆོས་དེ་དག་ཀྱང་སྤྲུལ་པ་ལགས་སམ།
en: Blessed Lord, are the attributes of ‘abandonment,’ which are associated with the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, the level of the pratyekabuddhas, the level of the buddhas, and the abandonment of all the connecting propensities, also phantom emanations?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བསྐྱེད་པ་འམ། བཀག་པའི་ཆོས་གང་ཅི་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ནི་སྤྲུལ་པའོ། །གསོལ་པ།
en: Subhūti, all phenomena whatsoever that have arisen or ceased are phantom emanations,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་གང་མ་སྤྲུལ་པའི་ཆོས་དེ་གང་ལགས།
en: Blessed Lord, what is not a phantom emanation?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་གང་ལ་སྐྱེ་བ་ཡང་མེད། འགག་པ་ཡང་མེད་པ་དེ་ནི་མ་སྤྲུལ་པའོ།
en: That which is without arising or ceasing is not a phantom emanation,” replied the Blessed One. {

source: དེ་གང་ལགས།
en: VIII: 179} “What is that?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མི་མཉམ་པའི་མྱ་ངན་ལས་འདས་པ་སྟེ། ཆོས་དེ་ནི་མ་སྤྲུལ་པའོ། །གསོལ་པ།
en: Peerless nirvāṇa—that is not a phantom emanation,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ། སྟོང་པ་ཉིད་ལས་ཀྱང་མི་གཡོ་ལ། གཉིས་སུ་ཡང་མི་དམིགས་ཏེ།
en: The Blessed One has said, ‘There is no stirring at all from emptiness, nor is duality apprehended.

source: ཆོས་གང་ཡང་སྟོང་པ་ཉིད་མ་ཡིན་པ་དེ་ལྟ་བུ་མེད་དོ་ཞེས་བཀའ་སྩལ་པ།
en: There is nothing at all that is not emptiness.’

source: ལྟར་ན་བཅོམ་ལྡན་འདས་མི་མཉམ་པའི་མྱ་ངན་ལས་འདས་པ་ཡང་སྤྲུལ་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Therefore, Blessed Lord, peerless nirvāṇa is also a phantom emanation.” “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་སྟེ།
en: Subhūti, all phenomena are empty.

source: དེ་དག་ནི་ཉན་ཐོས་ཀྱིས་མ་བྱས།
en: They have not been created by the śrāvakas.

source: རང་སངས་རྒྱས་ཀྱིས་མ་བྱས།
en: They have not been created by the pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མ་བྱས།
en: They have not been created by bodhisattva great beings.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་མ་བྱས་ཏེ།
en: They have not been created by tathāgatas, arhats, completely awakened buddhas.

source: ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་མྱ་ངན་ལས་འདས་པའོ།
en: The emptiness of inherent existence is nirvāṇa.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ལས་དང་པོ་པའི་གང་ཟག་གིས། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཡོངས་སུ་འཚལ་བར་བགྱི་ན། ཇི་ལྟར་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི།
en: Subhūti then asked, “Blessed Lord, how should an individual who is a beginner be instructed and advised, so as to understand the emptiness of inherent existence?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཅི་སྔོན་དངོས་པོ་ཡོད་པར་འགྱུར་ལ། ཕྱིས་དངོས་པོ་མེད་པར་འགྱུར་བ་ཡོད་དམ།
en: Subhūti,” replied the Blessed One, “has there been an entity in the past that will become a nonentity in the future?

source: རབ་འབྱོར་འདི་ལ་དངོས་པོ་ཡོད་པ་ཡང་མེད། དངོས་པོ་མེད་པ་ཡང་མེད། ངོ་བོ་ཉིད་ཀྱང་མེད། གཞན་གྱི་དངོས་པོ་ཡང་མེད་ན། དེ་ལ་གང་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ལྟ་ཡོད་པར་འགྱུར་རེ་སྐན།
en: In this regard, Subhūti, since there is no entity, no nonentity, no inherent existence, and no extraneous entity, how could there possibly be something called the emptiness of inherent existence that they should comprehend!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཆོས་ཉིད་མི་འགྱུར་བ་བསྟན་པའི་ལེའུ་སྟེ་བདུན་ཅུ་གཅིག་པའོ་།། །།
en: This completes the seventy-first chapter, “The Teaching on the Unchanging True Nature,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.” {

source: བམ་པོ་བདུན་ཅུ་དྲུག་པ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ཞུས་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་སློབ་པར་འཚལ་བས།
en: VIII: 145} Chapter 72: The Divisions of a Bodhisattva’s Training Then the bodhisattva great being Maitreya asked the Blessed One, “Blessed Lord, how should bodhisattva great beings who seek to practice the perfection of wisdom, and train in the trainings of the bodhisattvas, {Ki.

source: གཟུགས་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: VIII: 146} train with regard to physical forms?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། མིག་གི་སྐྱེ་མཆེད་དང་།
en: How should they train with regard to feelings, perceptions, formative predispositions, and consciousness?

source: རྣ་བའི་སྐྱེ་མཆེད་དང་། སྣའི་སྐྱེ་མཆེད་དང་། ལྕེའི་སྐྱེ་མཆེད་དང་། ལུས་ཀྱི་སྐྱེ་མཆེད་དང་། ཡིད་ཀྱི་སྐྱེ་མཆེད་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། གཟུགས་ཀྱི་སྐྱེ་མཆེད་དང་།
en: How should they train with regard to the sense field of the eyes, the sense field of the ears, the sense field of the nose, the sense field of the tongue, the sense field of the body, and the sense field of the mental faculty?

source: སྒྲའི་སྐྱེ་མཆེད་དང་། དྲིའི་སྐྱེ་མཆེད་དང་། རོའི་སྐྱེ་མཆེད་དང་། རེག་བྱའི་སྐྱེ་མཆེད་དང་། ཆོས་ཀྱི་སྐྱེ་མཆེད་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་།
en: How should they train with regard to the sense field of sights, the sense field of sounds, the sense field of odors, the sense field of tastes, the sense field of touch, and the sense field of mental phenomena?

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: How should they train with regard to the sensory element of the eyes, the sensory element of sights, the sensory element of visual consciousness, the sensory element of the ears, the sensory element of sounds, the sensory element of auditory consciousness, the sensory element of the nose, the sensory element of odors, the sensory element of olfactory consciousness, the sensory element of the tongue, the sensory element of tastes, the sensory element of gustatory consciousness, the sensory element of the body, the sensory element of touch, the sensory element of tactile consciousness, the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness?

source: ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། མིག་གི་འདུས་ཏེ་རེག་པའི་སྐྱེ་མཆེད་དང་། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་སྐྱེ་མཆེད་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: How should they train with regard to the sense field of visually compounded sensory contact and the sense fields of aurally, nasally, lingually, corporeally, and mentally compounded sensory contact?

source: མ་རིག་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: How should they train with regard to ignorance?

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་།
en: How should they train with regard to formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death?

source: སྐྱེ་བ་དང་རྒ་ཤི་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: How should they train with regard to the truth of suffering?

source: སྡུག་བསྔལ་གྱི་བདེན་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། ཀུན་འབྱུང་བའི་བདེན་པ་དང་། འགོག་པའི་བདེན་པ་དང་། ལམ་གྱི་བདེན་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: How should they train with regard to the truth of the origin of suffering, the truth of cessation, and the truth of the path?

source: གཟུགས་དང་ཆོས་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། གཟུགས་མེད་པ་དང་། སྣང་བ་དང་བཅས་པ་དང་། སྣང་བ་མེད་པ་དང་ཐོགས་པ་དང་བཅས་པ་དང་། ཐོགས་པ་མེད་པ་དང་འདུས་བྱས་དང་འདུས་མ་བྱས་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། བསྟན་པར་བྱ་བ་དང་། བསྟན་པར་མི་བྱ་བ་དང་།
en: How should they train with regard to material phenomena?

source: བཟང་པོ་དང་ངན་པ་དང་ནང་གི་དང་ཕྱིའི་དང་མཐོང་བ་དང་ཐོས་པ་དང་། ཤེས་པ་དང་རྣམ་པར་ཤེས་པ་དང་། འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་གྱི་དང་། དགེ་བ་དང་མི་དགེ་བ་དང་ལུང་སྟོན་པ་དང་ལུང་མ་བསྟན་པ་དང་། འདོད་པར་གཏོགས་པ་དང་། གཟུགས་སུ་གཏོགས་པ་དང་། གཟུགས་མེད་པར་གཏོགས་པ་དང་མ་གཏོགས་པ་དང་། སློབ་པ་དང་མི་སློབ་པ་དང་། སློབ་པ་ཡང་མ་ཡིན། མི་སློབ་པ་ཡང་མ་ཡིན་པ་དང་། འདོད་ཆགས་དང་། ཁོང་ཁྲོ་བ་དང་། ང་རྒྱལ་དང་།
en: How should they train with regard to phenomena that are immaterial, visible, invisible, impeded, unimpeded, conditioned, unconditioned, contaminated, uncontaminated, inadmissible, admissible, revealed, unrevealed, positive, negative, internal, external, seen, heard, known, cognized, past, future, present, virtuous, nonvirtuous, specific, indeterminate, included [and not included] in the realm of desire, included [and not included] in the realm of form, included and not included in the realm of formlessness, associated with [the paths of] learning, no more learning, and neither learning nor no more learning, and associated with desire, anger, pride, ignorance, wrong view, and hesitation?

source: མ་རིག་པ་དང་། ལྟ་བ་དང་ཐེ་ཚོམ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། སྦྱིན་པ་དང་སེར་སྣ་དང་། ཚུལ་ཁྲིམས་དང་ཚུལ་ཁྲིམས་ངན་པ་དང་། བཟོད་པ་དང་གནོད་སེམས་དང་། བརྩོན་འགྲུས་དང་ལེ་ལོ་དང་བསམ་གཏན་དང་། གཡེང་བ་དང་ཤེས་རབ་དང་།
en: How should they train with regard to phenomena that are generous, miserly, ethical, unethical, tolerant, malicious, persevering, indolent, concentrated, distracted, wise, and stupid?

source: ཤེས་རབ་ངན་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི། སྟོང་པ་ཉིད་དང་རྣམ་པར་རྟོག་པ་དང་། མཚན་མ་མེད་པ་དང་། མཚན་མ་དང་སྨོན་པ་མེད་པ་དང་། ལོག་པའི་སྨོན་ལམ་དང་། མི་དགེ་བའི་ཆོས་དང་། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: How should they train with regard to emptiness and conceptual thought, signlessness and signs, wishlessness and false aspirations, nonvirtuous phenomena, impermanence, suffering, and nonself?
